app/Controllers/Admin.php

    public function detail()
    {
        $data = [
            //         'user' => $this->user,
            'title' => 'POLDA JATENG - Detail Pengaduan',
            //         'data' => $this->pengaduan->find($id),
            //         'bukti' => $this->bukti->getBukti($id),

        ];
---
SELECT *
FROM `users`
WHERE `id` = '4'