app/Controllers/Admin.php

SELECT *
FROM `users`
WHERE `username` = 'Asstro'
---
    public function tentang()
    {
        $userlogin = user()->username;
        $builder = $this->db->table('user');
        $builder->select('username,email,user,created_at');
        $this->builder->where('username', $userlogin);

SELECT *
FROM `pengaduan`
---
    public function pengaduan()
    {
        $this->builder = $this->db->table('pengaduan');
        $this->builder->select('*');
        $this->query = $this->builder->get();

SELECT *
FROM `pengaduan`
WHERE `id` = '54'
SELECT *
FROM `tbl_bukti`
WHERE `pengaduan_id` = '54'
---
    public function detail($id)
    {
        $data=$this->db->table('pengaduan');
        $data->select('*');
        $data->where('id',$id);
        $query=$data->get()->getRow();

        $bukti=$this->db->table('tbl_bukti');
        $bukti->select('*');
        $bukti->where('pengaduan_id',$id);
        $query1=$bukti->get()->getRowArray();

SELECT *
FROM `pengaduan`
WHERE `status` = 'diproses'
---
    public function pengaduan_diproses()
    {
        $this->builder = $this->db->table('pengaduan');
        $this->builder->select('*');
        $this->builder->where('status', 'diproses');
        $this->query = $this->builder->get();

UPDATE `pengaduan` SET `tanggal_diproses` = '2022-11-26 07:57:46', `status` = 'diproses'
WHERE `pengaduan`.`id` IN ('57')
---
    public function prosesPengaduan($id)
    {
        $date =
        $this->pengaduan->update($id,[
            'tanggal_diproses' => date("Y-m-d h:i:s"),
            // 'status' => 'diproses',

        ]);