app/Controllers/Admin.php

    public function tentang()
    {
        $userlogin = user()->username;
        $userid = user()->id;
        $role = $this->db->table('auth_groups_users')->where('user_id', $userid)->get()->getRow();
        // dd($role);
        $role->group_id == '1' ? $role_echo = 'Admin' : $role_echo = 'User';


        $builder = $this->db->table('user');
        $builder->select('username,email,user,created_at');
        $this->builder->where('username', $userlogin);
---
SELECT *
FROM `auth_groups_users`
WHERE `user_id` = '4'
SELECT *
FROM `users`
WHERE `username` = 'admin_humas'

    public function simpanProfile($id)
    {
        $userlogin = user()->username;
        $builder = $this->db->table('users');
        $builder->select('*');
        $query = $builder->where('username', $userlogin)->get()->getRowArray();



        $foto = $this->request->getFile('foto');
        if ($foto->getError() == 4) {
            $this->profil->update($id, [
                'email' => $this->request->getPost('email'),
                'username' => $this->request->getPost('username'),
            ]);
        } else {


            $nama_foto = 'AdminFOTO' . $this->request->getPost('username') . '.' . $foto->guessExtension();
            if (!(empty($query['foto']))) {
                unlink('uploads/profile/' . $query['foto']);
            }
            $foto->move('uploads/profile', $nama_foto);

            $this->profil->update($id, [
                'email' => $this->request->getPost('email'),
                'username' => $this->request->getPost('username'),
                'foto' => $nama_foto
            ]);
---
SELECT *
FROM `users`
WHERE `username` = 'ashiap'
UPDATE `users` SET `email` = 'humas_jateng@gmail.com', `username` = 'admin_humas', `foto` = 'AdminFOTOashiap.png'
WHERE `users`.`id` IN ('4')

    public function detail($id)
    {
        $data = $this->db->table('pengaduan');
        $data->select('*');
        $data->where('id', $id);
        $query = $data->get()->getRow();

        $d = $this->db->table('balasan');
        $d->select('*');
        $d->where('id_pengaduan', $id);
        $balasan = $d->get()->getRow();

        $bukti = $this->db->table('tbl_bukti');
        $bukti->select('*');
        $bukti->where('pengaduan_id', $id);
        $query1 = $bukti->get()->getRowArray();
---
SELECT *
FROM `pengaduan`
WHERE `id` = '54'
SELECT *
FROM `balasan`
WHERE `id_pengaduan` = '54'
SELECT *
FROM `tbl_bukti`
WHERE `pengaduan_id` = '54'

    public function updatePassword($id)
    {



        $passwordLama = $this->request->getPost('passwordLama');
        $passwordbaru = $this->request->getPost('passwordBaru');
        $konfirm = $this->request->getPost('konfirm');

        if ($passwordbaru != $konfirm) {
            session()->setFlashdata('error-msg', 'Password Baru tidak sesuai');
            return redirect()->to(base_url('admin/tentang/' . $id));
        }
        $builder = $this->db->table('users');
        $this->builder->where('id', user()->id);
        $query = $this->builder->get()->getRow();
        $verify_pass = password_verify(base64_encode(hash('sha384', $passwordLama, true)), $query->password_hash);

        // dd($query);
        if ($verify_pass) {
            $users = model(UserModel::class);
            $entity = new passwd();
            $entity->setPassword($passwordbaru);
            $hash  = $entity->password_hash;
            $users->update($id, ['password_hash' => $hash]);
---
UPDATE `users` SET `password_hash` = '$2y$10$QTvJXlwdFEmKj/JfX.qaRO0nknt7TMfPfjg/vKHVEnjU3oEcAUsvq', `updated_at` = '2022-11-28 00:43:08'
WHERE `users`.`id` IN ('4')