app/Controllers/User.php

SELECT *
FROM `pengaduan`
WHERE `id_user` = '2'
---
    public function pengaduan()
    {

        // $builder    = $this->db->table('pengaduan');
        // $builder->orderBy('id', 'ASC');
        // $query      = $builder->get()->getResult();
        // $data['pengaduan'] = $query;
        $this->builder = $this->db->table('pengaduan');
        $this->builder->select('*');
        $this->builder->where('id_user', user()->id);
        $this->query = $this->builder->get();

SELECT *
FROM `pengaduan`
WHERE `id` = '27'
SELECT *
FROM `tbl_bukti`
WHERE `pengaduan_id` = '27'
---
    public function detail($id)
    {
        $data = $this->db->table('pengaduan');
        $data->select('*');
        $data->where('id', $id);
        $query = $data->get();

        $bukti = $this->db->table('tbl_bukti');
        $bukti->select('*');
        $bukti->where('pengaduan_id', $id);
        $query1 = $bukti->get()->getRowArray();