app/Controllers/User.php

    public function tentang()
    {

        $userlogin = user()->username;
        $userid = user()->id;
        $role = $this->db->table('auth_groups_users')->where('user_id', $userid)->get()->getRow();
        $role == '1' ? $role_echo = 'Admin' : $role_echo = 'User';



        $data = $this->db->table('pengaduan');
        $query1 = $data->where('id_user', $userid)->get()->getResult();
        $builder = $this->db->table('users');
        $builder->select('id,username,email,created_at,foto');
        $builder->where('username', $userlogin);
        $query = $builder->get();
---
SELECT *
FROM `auth_groups_users`
WHERE `user_id` = '2'
SELECT *
FROM `pengaduan`
WHERE `id_user` = '2'
SELECT `id`, `username`, `email`, `created_at`, `foto`
FROM `users`
WHERE `username` = 'Ada'

    public function detail($id)
    {
        $data = $this->db->table('pengaduan');
        $data->select('*');
        $data->where('id', $id);
        $query = $data->get();

        $d = $this->db->table('balasan');
        $d->select('*');
        $d->where('id_pengaduan', $id);
        $balasan = $d->get()->getRow();

        $bukti = $this->db->table('tbl_bukti');
        $bukti->select('*');
        $bukti->where('pengaduan_id', $id);
        $query1 = $bukti->get()->getRowArray();
---
SELECT *
FROM `pengaduan`
WHERE `id` = '58'
SELECT *
FROM `balasan`
WHERE `id_pengaduan` = '58'
SELECT *
FROM `tbl_bukti`
WHERE `pengaduan_id` = '58'